In [1]:
import numpy as np
import pandas as pd

In [15]:
from pandas import Series, DataFrame

#### 1) 다음은 NBA 선수들의 2021년 득점기록을 나타낸 것이다. Dictionary 형태로 되어 있는 것을 각 key값을 column으로 하는 데이터 프레임으로 변환하시오

In [2]:
score_2021 = {"birthyear": {"Paul":1985, "Lebron": 1984, "Durant": 1988},
              "height": {"Durant":208, "Lebron": 206, "Paul": 183},
              "score_21": {"Durant": 380, "Paul": 118}
}

In [3]:
frame = pd.DataFrame(score_2021)
frame

        birthyear  height  score_21
Paul         1985     183     118.0
Lebron       1984     206       NaN
Durant       1988     208     380.0

#### 2) Paul, Lebron, Durant의 assist수가 각각 20, 15, 10이라고 할 때 해당 컬럼을 추가해 보시오

In [4]:
frame['assist'] = 20, 15, 10
frame

        birthyear  height  score_21  assist
Paul         1985     183     118.0      20
Lebron       1984     206       NaN      15
Durant       1988     208     380.0      10

#### 3) height 200이상이고 assist 값이 13 이상인 농구선수를 추출하는 코드를 작성하시오

In [6]:
frame2 = frame[frame['height'] >= 200]
frame2

        birthyear  height  score_21  assist
Lebron       1984     206       NaN      15
Durant       1988     208     380.0      10

In [7]:
frame3 = frame2[frame2['assist'] >= 13]
frame3

        birthyear  height  score_21  assist
Lebron       1984     206       NaN      15

#### 다음은 위의 농구선수들의 각 월별(1월, 2월, 3월) 득점수를 나타낸 것이다.

In [8]:
score_array = np.array([[80,90,100],[110,140,150],[145, 157, 155], [201, 70, 198]])
score_by_month = pd.DataFrame(score_array, columns=["1월", "2월", "3월"], index=["Lebron","Paul","Durant","Curry"])
score_by_month

         1월   2월   3월
Lebron   80   90  100
Paul    110  140  150
Durant  145  157  155
Curry   201   70  198

#### 4) 선수별 월 평균득점을 추출하는 코드를 작성하시오.

In [9]:
score_by_month.mean()

1월    134.00
2월    114.25
3월    150.75
dtype: float64

#### 5) 월별 선수들의 득점의 합을 추출하는 코드를 작성하시오

In [10]:
score_by_month.sum()

1월    536
2월    457
3월    603
dtype: int64